[
  {
    "path": "posts/2021-05-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Qian Ziwei",
        "url": {}
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nThe title of the graph does not convey the intent of the graph well.\r\nIn this case, the graph is trying to show changes in import and export amounts over time for six trading countries and compare them.\r\n‘Top’ included in the header, but ranking the total imports and exports in the source data(from 2019 to 2020), not exactly these six countries.\r\nThe title does not indicate the unit of calculation of the import and export amount.\r\nThe time indicated in the title and the time shown in the chart contradict each other. The title indicates that the chart shows the amount of import and export data from 2019 to 2020, but the graphs of Hong Kong, Mainland China, Malaysia, Taiwan and US show the amount from 2019-2021. And the graph of Japan show the amount of 2020 only.\r\n\r\nThe content of the graph\r\nThe area charts are used, which can mislead people into thinking that the areas are meant to show the cumulative imports and exports. However the main topic is to look at the yearly change of import and export amount and compare them.\r\nY-axis: the units of the y-axis are not uniform(between the six graphs and even for the export and import in the same graph) which is difficult to compare. This does not help to reflect the shortfall between imports and exports.\r\nX-axis: the ranges of x-axis of six countries are different. The range of x-axis of Hong Kong, Mainland China, Malaysia, Taiwan and US are from 2019-2021. And the time of Japan is 2020 only.\r\n\r\n1.2 Aesthetic\r\nThere is poor use of colors in the chart. The large number of overlapping blue and orange blocks in the chart can be confusing.\r\nBoth values of x-axis and y-axis are not uniform\r\nThere is no annotations used to convey important points, leaving the reader to infer the purpose of the graph.\r\nThere is no data sources.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nDelete the ‘top’ included in the title to avoid spreading the wrong information.\r\nTitle and subtitle show the objectives and explain abbreviations and definitions that will be used in the graph.\r\nAdd a new calculated field ‘Net exports(imports-exports)’ to show the changes in the balance. And add the caption to explain the calculation function of net exports, trade surplus and trade deficit.\r\nExports, imports, and net exports for the six countries have the same scale on the x-axis separately, making it easy to compare the data for the six countries.\r\nThe units of the y-axis are uniform. All six countries use the data from Jan 2019 to Dec 2020.\r\n2.2 Aesthetic\r\nAnnotations are used to emphasize key observations.\r\nColor is used to bring to attention different categories(different countries, trade surplus and trade deficit)\r\nAdd data sources and explanation to help customers to read the graph.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here(link–tableau public)\r\n4.0 Step-by-step Guide\r\nNo\r\nStep\r\nAction\r\n5.0 Derived Insights\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-26T23:13:38+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
