[
  {
    "path": "posts/2021-05-26-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [
      {
        "name": "Qian Ziwei",
        "url": {}
      }
    ],
    "date": "2021-05-26",
    "categories": [],
    "contents": "\r\n1.0 Critique of Visualization\r\nThe original visualization can be seen below.\r\n\r\n1.1 Clarity\r\nThe title of the graph does not convey the intent of the graph well.\r\nThe title indicates that it is the import and export value of six countries, but HongKong and Taiwan are not conutries.\r\nIn this case, the graph is trying to show changes in import and export amounts over time for six trading countries and compare them.\r\n‘Top’ included in the header, but ranking the total imports and exports in the source data(from 2019 to 2020), not exactly these six countries.\r\nThe title does not indicate the unit of calculation of the import and export amount.\r\nThe time indicated in the title and the time shown in the chart contradict each other. The title indicates that the chart shows the amount of import and export data from 2019 to 2020, but the graphs of Hong Kong, Mainland China, Malaysia, Taiwan and US show the amount from 2019-2021. And the graph of Japan show the amount of 2020 only.\r\n\r\nThe content of the graph\r\nThe area charts are used, which can mislead people into thinking that the areas are meant to show the cumulative imports and exports. However the main topic is to look at the yearly change of import and export amount and compare them.\r\nY-axis: the units of the y-axis are not uniform(between the six graphs and even for the export and import in the same graph) which is difficult to compare. This does not help to reflect the shortfall between imports and exports.\r\nX-axis: the ranges of x-axis of six countries are different. The range of x-axis of Hong Kong, Mainland China, Malaysia, Taiwan and US are from 2019-2021. And the time of Japan is 2020 only.\r\n\r\n1.2 Aesthetic\r\nThere is poor use of colors in the chart. The large number of overlapping blue and orange blocks in the chart can be confusing.\r\nBoth values of x-axis and y-axis are not uniform\r\nThere is no annotations used to convey important points, leaving the reader to infer the purpose of the graph.\r\nThere is no data sources.\r\n2.0 Alternative Design\r\nThe proposed design is as follows.\r\n\r\n2.1 Clarity\r\nReplace countries with regions in the title.\r\nDelete the ‘top’ included in the title to avoid spreading the wrong information.\r\nTitle and subtitle show the objectives and explain abbreviations and definitions that will be used in the graph.\r\nAdd a new calculated field ‘Net exports(exports-imports)’ to show the changes in the balance. And add the caption to explain the calculation function of net exports, trade surplus and trade deficit.\r\nExports, imports, and net exports for the six regions have the same scale on the x-axis separately, making it easy to compare the data for the six countries.\r\nThe units of the y-axis are uniform. All six regions use the data from Jan 2019 to Dec 2020.\r\n2.2 Aesthetic\r\nAnnotations are used to emphasize key observations.\r\nColor is used to bring to attention different categories(different regions, trade surplus and trade deficit)\r\nAdd data sources and explanation to help customers to read the graph.\r\n3.0 Proposed Visualization\r\nPlease view the interactive visualization on Tableau Public here.\r\n4.0 Step-by-step Guide\r\nNo\r\nStep\r\nAction\r\n1\r\nSelect the import and export amounts of HongKong, Japan, Mainland China, Taiwan, Malaysia and United state from the source file.\r\nShow imports as a example \r\n2\r\nSelect the data from Jan 2019 to Dec 2020.\r\nShow imports as a example \r\n3\r\nCompare the data of imports and exports and adjust the form.\r\nShow part of the document \r\n4\r\nImport the data into Tableau.\r\n\r\n5\r\nAdjust the data type of variables.\r\n\r\n6\r\nAdd the title and subtitle.\r\n\r\n7\r\nAdd the caption.\r\n\r\n8\r\nRight click on the blank area of ‘Data’ area. Create a new calculation field to show the changes in the balance.\r\n\r\n9\r\nThe new calculation field called ‘Net Exports’ which is equal to exports minus imports.\r\n\r\n10\r\nRight click on the small triangle of ‘YEAR(Time)’ area.Put the ‘Time’ into the Columns and change the unit from ‘YEAR’ to ‘Month’.\r\n\r\n11\r\nPut the ‘Country’ into the Columns\r\n\r\n12\r\nPut the ‘Imports(Thousand Dollars)’, ‘Exports(Thousand DOllars)’ and ‘Net exports’ into the Rows.\r\n\r\n13\r\nRight click on the small triangle of ‘CNTD’ area.Change the measure way of the ‘Imports(Thousand Dollars)’ and  ‘Exports(Thousand DOllars)’.\r\n\r\n14\r\nChange the Marks of ‘SUM(Imports(Thousand Dollars))’. Use ‘Country’ as ‘Color’ and ‘SUM(Imports(Thousand Dollars))’ as ‘Label’.\r\n\r\n15\r\nChange the Marks of ‘SUM(Exports(Thousand Dollars))’. Use ‘Country’ as ‘Color’ and ‘SUM(Exports(Thousand Dollars))’ as ‘Label’.\r\n\r\n16\r\nChange the Marks of ‘SUM(Net exports(Thousand Dollars))’. Use ‘SUM(Net exports(Thousand Dollars))’ as ‘Color’ and ‘SUM(Net exports(Thousand Dollars))’ as ‘Label’.\r\n\r\n17\r\nChange the ‘Label’ format for aesthetic. Set the number with 0 decimal places and thousands unit.\r\n\r\n18\r\nChange the ‘Label’ display from show all to show only the maximum and minimum values.\r\n\r\n19\r\nChange the ‘Color’ of ‘SUM(Net exports(Thousand Dollars))’. The negative number is red and the positive is blue.\r\n\r\n20\r\nRight click on the main graph area or the important points and select annotate. Type in insights and observations in the text area. Arrange, resize, or format the resulting text box if required.\r\n\r\n21\r\nThe final dashboard is ready!\r\n\r\n5.0 Derived Insights\r\nIn this six regions, Hongkong has the lowest imports and the second highest exports, and both of imports and exports amounts change relatively flat, with a slow upward trend. So the net exports of Hongkong is the highest. Hongkong has strong trade surplus and is in a favorable position in the foreign trade, but Hongkong may also face the problem of excessive external dependence.\r\n 2. In this six regions, the Mainland China has the highest imports and exports, but the lines of imports and exports are dramatic fluctuations. Most of the time, the Mainland China are in the trade surplus.\r\nImports: The Mainland China imports curve has two points of sudden decline, one point is February 2019 and another is January 2020.\r\nFebruary 2019(from 6,217k to 4,037k): From the article called Commentary on February 2019 import and export data: the rhythm of the Spring Festival to resume work disrupts foreign trade data, the reason of the sudden decline is the Chinese traditional festival–Spring Festival.\r\nJanuary 2020(from 6,389k to 3,979k): The reason of the sudden decline is the COVID-19.\r\n\r\nExports: The Mainland China exports curve has one point of sudden decline, the point is January 2020. The reason of the sudden decline is the COVID-19.\r\n 3. In these six regions, Taiwan imports curve continuously rising up to 4,912k and exports curve is stable at 2,000k with increasing trend from November 2020. But we can see that Taiwan is extremely trade deficit along with trend of increasing severity. By December 2020, trade deficit number is 2,374k.\r\n 4. In these six regions, the United States is the only region where changes in the imports and exports curves show an opposite trend. The imports curve shows an decreasing trend and the exports curve shows an increasing trend. So the United States is in the trade deficit before March 2020 and in the trade surplus after March 2020.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-27T18:20:14+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  }
]
